package game.mozzi.config.util;

import lombok.extern.slf4j.Slf4j;

import java.math.BigInteger;
import java.security.SecureRandom;
import java.util.Arrays;
import java.util.List;
import java.util.Random;

/**
 *  작성자 : beomchul.kim@lotte.net
 *  FileUtil - 랜덤유틸
 */
@Slf4j
public class RandomUtils {

    public static final List<String> twoWord = Arrays.asList("가난", "가넷", "가람", "가문", "가방", "가스", "가식", "가온", "가을" ,"삑삑도요","어미새" , "가족", "각성", "간지", "갈맷", "갈증", "감동", "감미", "감상", "감속", "감자", "감정", "희생", "히나", "히데", "히든", "히런", "히로", "히르", "히웅", "히잇", "히트", "힐러", "힐링", "힐쁨", "힐통", "힙합", "힛꿍", "가난","현실", "우주", "초코", "딸기", "여운", "여름", "가을", "겨울", "여행", "유다", "멜론", "가희", "감사", "감자", "건반", "검률", "검성", "검혼", "고독", "고백", "곰돌", "공간", "공주", "과일", "구름", "구슬", "귀염", "기도", "기린", "기쁨", "기사", "깜찍", "꼬마", "꽃잎", "나무", "나비", "난이", "냐옹", "노을", "눈물", "눈빛", "뉴별", "뉴히", "느낌", "다니", "다츠", "단휴", "달빛", "달콩", "도니", "도둑", "도적", "동감", "들꽃", "디디", "딸기", "라라", "레뉴", "로즈", "루시", "루엔", "류단", "리나", "리엘", "리유", "리치", "마마", "마음", "매력", "매화", "맹꽁", "멜론", "모모", "무결", "미노", "미니", "미니", "미미", "민영", "민첩", "민트", "바니", "바람", "바보", "배려", "백합", "번개", "법사", "베베", "벼리", "별빛", "보석", "분노", "붕어", "비령", "비밀", "비애", "비천", "뽀야", "사과", "사랑", "설희", "세나", "수라", "수희", "순수", "슈슈", "스즈", "슬픔", "시아", "시작", "신의", "아름", "아잉", "아트", "악마", "안개", "알콩", "앙증", "애교", "야수", "약속", "엘프", "연서", "연인", "연출", "연필", "영혼", "예쁜", "예술", "왕자", "우니", "우유", "운명", "웃음", "유리", "유린", "유명", "유하", "유화", "은하", "이별", "이브", "인연", "자유", "잠수", "저금", "전설", "절정", "조각", "증발", "지식", "창공", "처음", "천둥", "천사", "천운", "초연", "초월", "초코", "축복", "츄읍", "카라", "콜라", "쿠쿠", "키스", "키위", "키티", "태풍", "토끼", "투사", "티엔", "파괴", "파멸", "파이", "파파", "패닉", "편리", "편지", "포도", "폭풍", "풀잎", "하늘", "하니", "하린", "하유", "하이", "햇님", "햇살", "행복", "행운", "향기", "향수", "허브", "헤라", "헤르", "헤븐", "현이", "혜선", "혼돈", "홀릭", "희망", "히나", "히링", "히메", "히힛", "힐러", "숙면", "아가", "자국", "차쿤", "카덕", "타개", "파니", "하늘", "가넷", "가람", "가문", "가방", "가스", "가식", "가온", "가을", "가이", "가족", "각성", "간지", "갈맷", "갈무", "갈이", "갈증", "감동", "감미", "감상", "감속", "감자", "감정", "감투", "갑빠", "갑순", "갑옷", "강목", "강변", "강샘", "강철", "강해", "개구", "개미", "개발", "개인", "개폰", "거믈", "거상", "거울", "거지", "건강", "건담", "건빵", "검객", "검두", "검링", "검사", "검색", "검성", "검킹", "검파", "검팡", "게임", "겜블", "겨레", "겨울", "격노", "격류", "격멸", "격수", "격파", "격함", "견우", "결박", "결승", "결정", "결투", "경건", "경고", "경비", "경아", "경제", "경지", "경찰", "경합", "계곡", "고객", "고기", "고뇌", "고니", "고독", "고래", "고백", "고수", "고양", "고용", "고을", "고지", "고집", "고철", "고퀄", "곡물", "골프", "곰력", "곱샘", "곱창", "공간", "공갈", "공개", "공격", "공공", "공기", "공룡", "공멍", "공명", "공백", "공사", "공상", "공수", "공연", "공유", "공익", "공자", "공전", "공주", "공지", "공쮸", "공활", "곶감", "과속", "과열", "과일", "과자", "과학", "관객", "관심", "관자", "광고", "광기", "광끼", "광땡", "광명", "광야", "광주", "광포", "괴도", "괴력", "괴물", "교우", "교황", "구구", "구늬", "구름", "구릅", "구매", "구새", "구역", "구찌", "구추", "국가", "국내", "국립", "국보", "국아", "국제", "군대", "군림", "군밤", "군왕", "군자", "군조", "군히", "궁금", "궁뎅", "궁빛", "궁사", "궁지", "궁킹", "궁황", "권총", "귀검", "귀염", "귀욤", "그녀", "그늘", "그랑", "그래", "그램", "그루", "그린", "그림", "그물", "극강", "극건", "극검", "극딜", "극야", "근년", "근성", "근신", "글속", "금성", "금탑", "급조", "기교", "기대", "기도", "기뢰", "기백", "기쁨", "기사", "기소", "기술", "기습", "기신", "기자", "기적", "기준", "기키", "기타", "기품", "기회", "기획", "길미", "김솔", "김치", "까꿍", "까밍", "까바", "까치", "깜디", "깜찍", "깝군", "깡따", "깡이", "깡통", "깨굴", "깨스", "꼬꽁", "꼬댕", "꼬땡", "꼬마", "꼬망", "꼬맹", "꼬미", "꼴통", "꼼밈", "꼼지", "꽁꽁", "꽁초", "꽃길", "꽃이", "꽃잎", "꽃탱", "꿀꿀", "꿀링", "꿀벌", "꿀잼", "꿀치", "꿀팁", "꿀힐", "꿈속", "꿈터", "뀨뀨", "끈기", "끔스", "나나", "나노", "나눔", "나라","나락", "나무", "나방", "나비", "나우", "나포", "낙령", "낙뢰", "난쟁", "난파", "날개", "날밤", "남극", "남자", "남친", "남편", "납득", "낭천", "냄비", "냄새", "냉각", "냉기", "냉동", "냐옹", "냥냥", "너랑", "너츠", "넙치", "네모", "네버", "네잎", "네티", "넬리", "노답", "노래", "노을", "노컷", "노트", "녹검", "녹즙", "녹차", "논란", "놀부", "농락", "농부", "뇌류", "뇌우", "누나", "누들", "누리", "누야", "눈물", "눈빛", "눈짓", "뉴문", "뉴스", "뉴욕", "느낌", "늑대", "능초", "니나", "니브", "니지", "다롱", "다루", "다섯", "다슬", "다운", "다윗", "다이", "다잉", "다크", "닥콩", "닥패", "단검", "단결", "단독", "단디", "단양", "단어", "단언", "단점", "단테", "단품", "달구", "달달", "달력", "달마", "달빛", "달이", "달인", "달징", "달콤", "담배", "담월", "담이", "담친", "당일", "당직", "당첨", "대군", "대기", "대령", "대부", "대세", "대장", "대진", "대찌", "대표", "대학", "대한", "대화", "더기", "더꾸", "더르", "더머", "더블", "더비", "더셀", "데드", "데칸", "델마", "도끼", "도덕", "도돌", "도둑", "도령", "도르", "도리", "도릿", "도발", "도어", "도적", "도전", "도트", "도파", "도하", "독고", "독방", "독일", "독점", "독종", "독특", "독해", "돌격", "돌풍", "동감", "동건", "동근", "동네", "동무", "동물", "동방", "동심", "동아", "동이", "동자", "동전", "동행", "돼지", "두근", "두럭", "두리", "두사", "두통", "둔기", "듀오", "드림", "득음", "듣남", "들꽃", "들온", "들찌", "등록", "디스", "디젤", "딜러", "딜함", "딜해", "딩동", "따름", "따솜", "딱딱", "딱총", "딴딴", "딸기", "땅콩", "때림", "땡보", "또모", "또미", "똑디", "똘기", "똘이", "뚜쉬", "뚜이", "뜨억", "라도", "라따", "라떼", "라래", "라면", "라미", "라봄", "라붐", "라웬", "라의", "라이", "라임", "라쿤", "라퀸", "라팜", "라헬", "라호", "란쉐", "란힝", "람뀨", "람보", "랏츄", "랑또", "랑신", "랑콤", "랜드", "러닝", "러미", "러브", "러빙", "러쉬", "럭키", "런던", "런처", "럼블", "레고", "레나", "레닌", "레드", "레디", "레몬", "레미", "레어", "레위", "레이", "레인", "레총", "레콩", "레터", "렌디", "렌트", "로니", "로뎅", "로드", "로또", "로마", "로비", "로빈", "로샤", "로슈", "로우", "로즈", "로칸", "로킥", "로티", "록맨", "록키", "론다", "롯데", "롯트", "료우", "료이", "료힝", "루거", "루나", "루니", "루디", "루루", "루미", "루비", "루이", "루저", "루즈", "루츠", "루키", "루팡", "루포", "루피", "루핀", "룰루", "뤼오", "류달", "류뚱", "류우", "류이", "류희", "르앤", "르윈", "리군", "리그", "리딩", "리마", "리본", "리뷰", "리신", "리쌍", "리어", "리얼", "리엣", "리오", "리제", "리즈", "리콜", "리턴", "리튬", "리틀", "림굼", "마나", "마녀", "마도", "마령", "마루", "마리", "마마", "마미", "마별", "마비", "마빡", "마신", "마을", "마음", "마일", "마족", "마초", "마켓", "마크", "마타", "마호", "마황", "막대", "막장", "막창", "만세", "만화", "말리", "말벌", "말썽", "맛집", "망송", "망치", "맞선", "매딕", "매력", "매실", "매일", "매직", "매치", "매혹", "매화", "맥주", "맨발", "맨솔", "맹꽁", "맹세", "맹자", "맹포", "맹폭", "맹풍", "머털", "머핀", "멀험", "멋찜", "멍개", "멍녀", "멍딜", "멍멍", "멍치", "메가", "메시", "메일", "멘사", "멘토", "멜로", "멜론", "멜짱", "멸검", "멸공", "멸살", "멸야", "멸치", "멸화", "명량", "명룡", "명목", "명사", "명서", "명성", "명언", "명예", "명운", "명장", "명중", "명화", "모네", "모노", "모둠", "모드", "모락", "모반", "모션", "모잉", "모카", "모터", "목탁", "몬쓰", "몰칵", "몽치", "묘르", "묘신", "무결", "무극", "무당", "무대", "무도", "무드", "무법", "무비", "무쌍", "무적", "무제", "무황", "무휼", "문화", "물개", "물랑", "물리", "물마", "물매", "물초", "물총", "물큰", "뮤리", "뮤즈", "뮤직", "뮤츠", "뮬란", "므앙", "므흑", "므흘", "미간", "미검", "미국", "미니", "미류", "미르", "미모", "미봄", "미슈", "미스", "미죤", "미카", "미키", "미투", "민국", "민율", "민첩", "민트", "믿음", "밀꽃", "밀당", "밀돌", "밀애", "밀크", "밍구", "밍꼬", "밍느", "밍듀", "밍뿌", "바람", "바보");
    public static final List<String> adjective = Arrays.asList("가냘픈", "거센", "게으른", "고달픈", "고마운", "멋진", "익명의", "밝은", "반가운", "외로운", "작은", "더러운", "새로운", "케케묵은", "탐스러운", "푸른", "둥그런", "동그란", "힘찬", "희망찬","나쁜", "나은", "날랜","낮은","너른","넓은","노란","높은", "누런","눅은","느린","늦은","다른","더운","덜된","딱한","때늦은","뛰어난","뜨거운","막다른","막중한","많은","매운","멋진","메마른","모난","못난","못된","못생긴","무딘","무서운","미운","미친","반가운", "밝은", "밤늦은", "보람찬","부른", "붉은","비싼", "빠른", "빨간", "뻘건", "뼈저린", "뽀얀","뿌연","새로운","서툰","섣부른", "설운","성가신","쉬운","슬픈","싫은","쓰디쓴","쓰린","아닌","아쉬운","아픈","안된","않은","알맞은","약빠른","약은","얇은","얕은","어두운","어려운","어린","언짢은","엄청난","없는","여문","열띤","예쁜", "이른","익은","있는","작은","잘난","잘빠진","잘생긴","적은","젊은","점잖은","조그만","줄기찬","즐거운","짓궂은","턱없는","힘겨운");

    /**
     * 랜덤닉네임 리턴
     * @return
     */
    public static String randomNickname(){
        Random rand = new Random();
        return adjective.get(rand.nextInt(adjective.size())) + " " + twoWord.get(rand.nextInt(twoWord.size()));
    }


    /**
     * State 난수생성
     * @return
     */
    public static String generateState()
    {
        SecureRandom random = new SecureRandom();
        return new BigInteger(130, random).toString(32);
    }
}

